#Вариант 2 - Кулькина
#Вариант 1
print("start code")
books = [
    {
        "title": "451 градус по Фаренгейту",
        "author": "Рей Бредбери", 
        "year": 1953
    },
    {
        "title": "Пять минут жизни", 
        "author": "Эмма Скотт",
        "year": 2022
    },
    {
        "title": "Инверсия жизни",
        "author": "Макс Максимов",
        "year": 2022
    },
    {
        "title": "Адвокат дьявола",
        "author": "Моррис Уэст", 
        "year": 1959
    },
    {
        "title": "Война и мир",
        "author": "Лев Толстой",
        "year": 1869
    }
]
# Выводим информацию о каждой книге
for i, book in enumerate(books, 1):
    print(f" ---------- Книга {i} ----------")
    print(f" Название: {book['title']}, Автор: {book['author']}, ")
    print(f" -------------{book['year']} ------------ ")
print("end")
